var map_cfg = {
    "mapWidth": "100%",
    "mapHeight": 320,
    
    "shadowWidth": 2,
    "shadowOpacity": 0.2,
    "shadowColor": "black",
    "shadowX": 0,
    "shadowY": 0,
    
    "iPhoneLink": true,
    "isNewWindow": false,
    
    "zoomEnable": false,
    "zoomEnableControls": false,
    "zoomIgnoreMouseScroll": false,
    "zoomMax": 8,
    "zoomStep": 0.8,
    
    "borderColor": "#ffffff",
    "borderColorOver": "#ffffff",
    "borderOpacity": 0.5,
    
    "nameColor": "#ffffff",
    "nameColorOver": "#ffffff",
    "nameFontSize": "10px",
    "nameFontWeight": "bold",
    
    "nameStroke": true,
    "nameStrokeColor": "#000000",
    "nameStrokeColorOver": "#000000",
    "nameStrokeWidth": 1.5,
    "nameStrokeOpacity": 0.5,
    
    "overDelay": 300,
    "nameAutoSize": false,
    
    "tooltipOnHighlightIn": false,
    "freezeTooltipOnClick": true,
    
    "mapId": "Z91FJz",
    
    "map_data": {
    "st1": {
        "id": 1,
        "name": "Африка",
        "shortname": "Африка",
        "link": "",
        "comment": "Африка включает в себя несколько крупных пустынь, таких как Сахара на севере континента и Калахари на юге. Эти области характеризуются сухим климатом и песчаными почвами.<br>Тундра присутствует в высокогорных областях некоторых частей Восточной Африки, например, в горах Эфиопии. Здесь высокогорные районы могут иметь климат и растительность, характерные для тундры.<br>Восточная и южная части Африки включают в себя степные зоны, такие как Саванны. Эти регионы характеризуются открытыми пространствами, высокой травянистой растительностью и специфичным видами животных.<br>В различных частях Африки существуют тропические и субтропические леса, которые можно рассматривать как смешанные леса. Примерами могут служить Конголезский дождевой лес в Центральной Африке и леса на восточном побережье континента.",
        "image": "",
        "color_map": "#7798bb",
        "color_map_over": "#366CA3"
    },
    "st2": {
        "id": 2,
        "name": "Азия",
        "shortname": "Азия",
        "link": "",
        "comment": "Тайга, или бореальные леса, простирается на севере Азии, охватывая значительные территории России, Сибири, а также некоторые северные области Китая и Японии.<br>Азия включает в себя несколько крупных пустынь, таких как Гоби в Монголии и Китае, а также знаменитая Аравийская пустыня на Аравийском полуострове.<br>Тундровые зоны можно найти в высокогорных областях, таких как высокогорья Центральной Азии. Также, субарктические тундры простираются на севере России.<br>Степные зоны распространены в различных частях Азии. Примерами могут служить степи в Центральной Азии, такие как степи Казахстана.<br>В Азии можно встретить смешанные леса, включающие как лиственные, так и хвойные деревья. Примерами являются леса Сибири и леса на восточных склонах Гималаев.",
        "image": "",
        "color_map": "#7798bb",
        "color_map_over": "#366CA3"
    },
    "st3": {
        "id": 3,
        "name": "Австралия и Океания",
        "shortname": "Австралия и Океания",
        "link": "",
        "comment": "Австралия содержит несколько крупных пустынь, таких как Симпсон в Австралийском внутреннем бассейне и Великая Виктория в центре континента. В Океании, например, есть пустынные районы в Австралийском северо-западе.<br>Некоторые области Австралии могут быть охарактеризованы степными условиями, особенно на севере и внутренних районах. Океания также включает в себя некоторые острова с разнообразной растительностью, в том числе степями.<br>Влажные тропические леса и леса смешанного типа преобладают в Австралии, особенно на восточном побережье. В Океании, также можно встретить разнообразные леса на островах, таких как Новая Зеландия.",
        "image": "",
        "color_map": "#7798bb",
        "color_map_over": "#366CA3"
    },
    "st4": {
        "id": 4,
        "name": "Центральная Америка",
        "shortname": "Центральная Америка",
        "link": "",
        "comment": "Пустыни в обычном понимании, с сухим климатом и песчаными дюнами, не являются характерными для Центральной Америки. Однако, некоторые области, например, в Мексике, могут иметь полупустынный клима.<br>Тропические и субтропические леса в Центральной Америке могут быть рассмотрены как смешанные леса, поскольку они включают в себя как лиственные, так и хвойные виды деревьев.",
        "image": "",
        "color_map": "#7798bb",
        "color_map_over": "#366CA3"
    },
    "st5": {
        "id": 5,
        "name": "Европа",
        "shortname": "Европа",
        "link": "",
        "comment": "Тайга, или бореальные леса, преимущественно характерны для северных широт, и часть её простирается в северных частях Европы, включая Россию.<br>В отличие от Африки и других регионов, Европа не имеет обширных пустынь. Однако, некоторые районы, такие как испанская Альмерия, могут иметь полупустынный характер.<br>Тундровые зоны встречаются в высокогорных областях, таких как Скандинавские горы и некоторые другие горные системы в северной части Европы. Здесь климат может быть достаточно суровым, а растительность низкорослой.<br>Степные зоны преимущественно распространены на востоке Европы, например, в регионе Великой степи, охватывая части Украины, России и других стран.<br>Европа характеризуется разнообразием лесных типов. Смешанные леса, состоящие из как лиственных, так и хвойных деревьев, присутствуют в различных частях континента.",
        "image": "",
        "color_map": "#7798bb",
        "color_map_over": "#366CA3"
    },
    "st6": {
        "id": 6,
        "name": "Северная Америка",
        "shortname": "Северная Америка",
        "link": "",
        "comment": "Тайга или бореальные леса преобладают в северных широтах Северной Америки. Эта зона характеризуется хвойными лесами, в основном сосной, елью, и лиственницей. Тайга охватывает значительные территории в Канаде и северных областях США.<br>На западе Северной Америки располагаются различные пустыни, такие как Сонора в юго-западной части США и Мексики. Эти районы характеризуются низкими осадками, высокими температурами и разнообразными ксерофитными растениями, способными выживать в условиях недостатка воды.<br>Северные части Канады и Аляски занимают тундровые зоны. Здесь климат холодный, а почва замерзает на глубине. Растительность тундры представлена низкими травами, мхами, лишайниками и некоторыми кустарниками.<br>В центральной части Северной Америки можно найти степные зоны, которые характеризуются полупустынным или полупустынно-травянистым покровом. Примером может служить степь в центральной части США, также известная как Пустая чаша. <br>Смешанные леса представлены в различных частях Северной Америки, особенно в средних широтах. Эта зона включает в себя как хвойные, так и лиственные деревья. Например, восточные части США и южные части Канады предлагают обширные территории смешанных лесов.",
        "image": "",
        "color_map": "#7798bb",
        "color_map_over": "#366CA3"
    },
    "st7": {
        "id": 7,
        "name": "Южная Америка",
        "shortname": "Южная Америка",
        "link": "",
        "comment": "Пустыни в обычном понимании, с сухим климатом и песчаными дюнами, встречаются в некоторых регионах Южной Америки. Примером может служить Атакама в Чили, считающаяся одной из самых сухих пустынь в мире.<br>Тундровые зоны распространены в высокогорных областях Южной Америки, таких как Анды. Здесь, на высоких альпийских лугах, растут короткие травы, мхи и лишайники.<br>Степные районы присутствуют в различных частях Южной Америки, таких как пампа в Аргентине и Уругвае. Эти регионы характеризуются открытыми пространствами, низкой растительностью и полупустынными условиями.<br>В Южной Америке обширные тропические и субтропические леса, включающие разнообразные виды растений и животных, могут быть рассмотрены как смешанные леса. Примерами являются Амазонский дождевой лес и леса на юго-востоке континента.",
        "image": "",
        "color_map": "#7798bb",
        "color_map_over": "#366CA3"
    }
}
}
;